a , b = 0, 1

for i in range(10):
    print(a)
    a, b = b, a + b

print("-*-*-*-*-*-*-*-*-*-")

# הגדרה של רשימה שתכיל את מספרי פיבונאצ'י הראשונים
fibonacci_numbers = []

# הגדרה של שני המספרים הראשונים בסדרת פיבונאצ'י
a = 0
b = 1

# לולאת for שתרוץ 10 פעמים כדי לקבל 10 מספרי פיבונאצ'י
for i in range(10):
    # הוספת המספר הנוכחי לרשימה
    fibonacci_numbers.append(a)

    # חישוב המספר הבא בסדרה: המספר החדש הוא סכום שני המספרים הקודמים
    c = a + b

    # עדכון הערכים של a ו-b לקראת האיטרציה הבאה
    a = b
    b = c

# הדפסת הרשימה של מספרי פיבונאצ'י
print(fibonacci_numbers)